# St7SetGeometryEdgeBeamProperty

Sets the beam property number to be created by the automesher on the specified geometry edge.

long St7SetGeometryEdgeBeamProperty(long uID, long EdgeNum, long PropNum)
Input Parameters
uID
Strand7 model file ID.
EdgeNum
Edge number.

PropNum
Edge beam property on the geometry edge.